{
  "backend/main.mo": "Motoko backend implementing user profile storage and task CRUD with authorization checks and task ownership enforcement.",
  "feature_evidence.json": "Report mapping product features to source files, components, tests, and confidence levels for traceability.",
  "frontend-file-summaries.txt": "Pre-written summaries describing roles of key frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, light/dark themes, and base element styles.",
  "frontend/index.html": "Main HTML entrypoint with mobile-focused meta tags, theme color, and references to favicon and app icon.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup flow, and routing into the main task UI.",
  "frontend/src/components/layout/MobileScaffold.tsx": "Mobile-first layout with header, user menu, content area, and footer, including logout handling.",
  "frontend/src/features/tasks/components/DeleteTaskConfirmDialog.tsx": "Confirmation dialog for deleting a task, showing loading state and invoking the delete mutation.",
  "frontend/src/features/tasks/components/TaskComposer.tsx": "Form component for creating a new task with title and description, calling useCreateTask on submit.",
  "frontend/src/features/tasks/components/TaskDetailsSheet.tsx": "Bottom sheet showing task details, status, description, and actions for edit or delete.",
  "frontend/src/features/tasks/components/TaskEditSheet.tsx": "Bottom sheet for editing a task’s title and description, submitting changes through useEditTask.",
  "frontend/src/features/tasks/components/TaskList.tsx": "Fetches tasks based on filter, sorts them, and renders TaskRow items with loading and empty states.",
  "frontend/src/features/tasks/components/TaskListControls.tsx": "UI controls for switching task filter and sort order using tabs and a select input.",
  "frontend/src/features/tasks/components/TaskRow.tsx": "Displays a single task with toggle, detail view, edit, and delete options via sheets and dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles and tasks through the actor API with cache invalidation and toast notifications.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom OKLCH color variables for light and dark themes with additional utilities like custom scrollbars.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/TasksPage.tsx": "Renders the main tasks screen with filters, sorting, task list, and a mobile-friendly task composer sheet.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters with hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and enabling plugins for container queries and animations.",
  "project_state.json": "Stores project metadata including features, requirements, known issues, and image generation needs for the Pocket Tasks app."
}